[{
 
"Portrayal": "https://www.treehugger.com/thmb/A85uonYJNlXDZeMyvxnmxA0UNCs=/735x0/__opt__aboutcom__coeus__resources__content_migration__mnn__images__2016__02__WheatFieldWithBlueCloudySky-cab45aaa81564ba99e2bd9a40932fd08.jpg",
 
 "Crop": "Wheat",
  
"SowingSeason": "October-December",
  
"HarvestingSeason": "January-March",
  
"CultivationPractice": "The wheat crop requires a well-pulverized but compact seed bed for good and uniform germination. Three or four ploughings in the summer, repeated harrowing in the rainy season, followed by three or four cultivations and planking immediately before sowing produce a good, firm seed bed for the dry crop on alluvial soils. Youtube Link:https://www.youtube.com/watch?v=6EoEzK4YYME",
 
 "type": "foodcrops"

},

{
 
"Portrayal": "https://5.imimg.com/data5/KM/CD/MY-4092332/ramganga-hybrid-coconut-plant-500x500.jpg",
 
 "Crop": "Coconut",
 
 "SowingSeason": "April to June",
  
"HarvestingSeason": "All around the year",
 
 "CultivationPractice": "To start to grow a coconut plant, begin with a fresh coconut that still has the husk on it. When you shake it, it still should sound like it has water in it. Soak it in water for two to three days. After the coconut has soaked, place it in a container filled with well-draining potting soil. It is best to mix in a little sand or vermiculite to make sure the soil you will be growing coconut trees in drains well. The container needs to be around 12 inches (30.5 cm.) deep to allow for the roots to grow properly. Plant the coconut point side down and leave one-third of the coconut above the soil. After planting the coconut, move the container to a well lit, warm spot – the warmer the better. Coconuts do best in spots that are 70 degrees F. (21 C.) or warmer. The trick to growing a coconut palm tree is to keep the coconut well watered during germination without letting it sit in overly wet soil. Water the coconut frequently, but make sure the container drains very well. You should see the seedling appear in three to six months. If you want to plant a coconut that has already sprouted, go ahead and plant it in well-draining soil so that the bottom two-thirds of the coconut is in the soil. Place in a warm area and water frequently. Youtube link:https://www.youtube.com/watch?v=5Eyz6yLHqVo ",
 
 "type": "plantationCrops"

},

{

"Portrayal": "https://balconygardenweb-lhnfx0beomqvnhspx.netdna-ssl.com/wp-content/uploads/2015/10/cashew-nut-growing_mini.jpg",
 
 "Crop": "Cashew",
 
 "SowingSeason": "June to August",
 
 "HarvestingSeason": "February to May",
 
 "CultivationPractice": "Fresh seeds germinate readily, so if you know of a cashew tree in your area, or have another way of getting hold of fresh seeds (that's the whole thing, shell and all, not just the nut!), you can grow cashew trees from seed. But be aware that cashew seeds don't grow true to type, meaning, the plant you get is not identical to the parent. It may not fruit as much or taste as nice.  Some fruit tree nurseries stock seedling or grafted trees. Commercial growers usually propagate their own. If you have a grower in the area you may be able to buy stock of him/her.  If you want to grow your cashew trees from seeds you can start them in pots or put them straight in the ground. Keep them moist and they should sprout within four or five days.  Best planting time? When you can get hold of fresh seed. The sooner you plant it, the better.  Select a well-drained spot (cashew trees don't like wet feet or heavy clay soils), preferably a place that has some protection from strong winds.  Mature trees need about 10 meters/30 feet distance between them and they grow to 12 meters/40 feet tall. Youtube Link: https://www.youtube.com/watch?v=BBRoJ7FkG7g",
  
"type": "plantationCrops"
},

{
  "Portrayal": "https://www.pepperhub.in/wp-content/uploads/2019/09/tripurarubber1.jpg",
 
 "Crop": "Rubber Tree",

  "SowingSeason": "May to August",
 
 "HarvestingSeason": "Time and interval of tapping (The best month to open new areas for tapping is March.)",
 
 "CultivationPractice": "For new plantings, jungle clearing with felling of trees has to be done first. Pits are usually dug to the size of the 1x1x1m3 and are filled up with soil and compost. Planting may be done in a rectangular or square or quincunx system during June-July.  The common spacings adopted for budded plants are In hilly areas - 6.7 x 3.4 m In flat areas-square - 4.9m x 4.9m Triangular - 4.9m x 4.9m, Youtube Link:https://www.youtube.com/watch?v=Z_nUczelwY8",
  
"type": "plantationCrops"

},
{
  
"Portrayal": "https://plantslive.in/wp-content/uploads/2017/10/coffee-plant.jpg",
 
 "Crop": "Coffee Plant",
 
 "SowingSeason": "June to December",

  "HarvestingSeason": "November to February",
 
 "CultivationPractice": "Coffee crop is propagated by seeds and cutting. Selection of quality seeds is very important in coffee growing. Make sure the seeds are heavy broad and boat-shaped. Remove any pulp from seeds by hand and these seeds should be rubbed with ash in order to avoid any sticking. Coffee seed should be allowed to dry under shade. Generally, from 4000 to 5000 coffee seeds are required to cover 1 hectare land. It is recommended to sow these seeds 2.5 cm apart. It takes about 30 to 40 days for germination after sowing in the field or nursery beds. These coffee seedlings should be uprooted and transplanted into polythene bags or in nursery beds at a spacing of 25 cm. Youtube Link:https://www.youtube.com/watch?v=JfKqLt8Ibr4",

  "type": "plantationCrops"

},

{
 
 "Portrayal": "https://i.ytimg.com/vi/M_Hs2SUzWpU/hqdefault.jpg",
 
 "Crop": "Mango",

  "SowingSeason": "August to October",
  
"HarvestingSeason": "April to May",
  
"CultivationPractice": "Mango seeds are normally discolored gray. To grow mangos from seed, remove the husk and plant the seed  (before it dries out) at soil level. The seeds normally germinate in two to four weeks, and do best with bottom heat.  Seedling mangos will bloom and bear in three to six years. Grafting process for mangoes is more likely done during May.  Plastic bagging with a few drops of moisture improves the grafting process. Mango fruit matures in 100 to 150 days after  flowering. The fruit will have the best flavor if allowed to ripen on the tree. When the first fruit shows color on tree,  all of that size fruit or larger may be removed. Repeat the process when remaining fruit colors. Youtube Link:https://www.youtube.com/watch?v=OoqzxjgovUg",
 
 "type": "hoticulturecrops"

},
{
  
 "Portrayal": "https://images-na.ssl-images-amazon.com/images/I/817-8OroqiL._SY550_.jpg",
 
 "Crop": "Banana Tree",
 
 "SowingSeason": "October-November",
 
 "HarvestingSeason": "15-18 months after planting",
 
 "CultivationPractice": "Bananas are fast-growing plant arising from underground rhizomes. The fleshy stalks formed by upright  concentric layers of leaf sheaths constitute the functional trunks. The true stem begins as an underground corm  which grows upwards, eventually producing the terminal inflorescence which will later bear the fruit. Each stalk  produces one huge flower cluster and then dies. New stalks then grow from the rhizome. The fruit can be harvested  by cutting the stalk. For tree-ripened fruit, cut one hand at a time as it ripens. Once harvested the stalk should  be hung in a cool, shady place. Ripening can be hastened by covering the bunch with a plastic bag. Once ripened it  is ready to consume. Youtube Link:https://www.youtube.com/watch?v=gaMqJfH8yXE",
 
 "type": "hoticulturecrops"

},
{
  

 "Portrayal": "https://myfasal.com/wp-content/uploads/2018/03/c46252a9-5928ec97e4951940698b456d.jpg",
 
 "Crop": "Ladie's finger",
 
 "SowingSeason": "Between January-March and June-August",

  "HarvestingSeason": "55 to 65 days after planting",

  "CultivationPractice": "Lady’s Finger seeds can do well in all kinds of soil. The land is prepared by giving 5-6 ploughings.  Pre sowing irrigation should be given in the soils having no sufficient moisture.   First irrigation is given  just after sowing and then the field is irrigated after 4 to 5 days in summer and 10 to 12 days in winter season.  Flowering begins from 35 to 40 days after sowing and fruits are ready for harvest four to five days after flowering.  The young fruits can be harvested in the morning. Delay in harvesting may make the fruits fibrous and they lose their  tenderness and taste. Youtube Link:https://www.youtube.com/watch?v=ybEUoJnqlEY",
 
 "type": "hoticulturecrops"

},
{
  


  "Portrayal": "https://i.ytimg.com/vi/qXdw-hBiu1A/maxresdefault.jpg",

  "Crop": "Tomato",
 
 "SowingSeason": "June - July",
  
"HarvestingSeason": "65 to 70 days after planting",
  "CultivationPractice": "Take care small pot or bag with drainage holes at the bottom. Fill it with potting mix You can use seed starting mix for that or just mix 60% normal Garden soil + 40 % vermicompost.or use well drained soil with good amount of organic matter as tomato plants require fertile soil for good harvest. Place the slices of tomato on the surface of the potting mix .you can also remove the tomato flesh to avoid any fungus growth. Lightly cover with soil and pat down lightly. Water well. Keep the port in partial shade and when the seeds start to germinate, move the pot into full sun or under grow lights. Seeds can be sown from September to October. Keep the soil evenly moist during the germination face. When the seedlings are 6 to 8 inches tall at that point you can transplant them at their final location. Youtube Link: https://www.youtube.com/watch?v=FSFBPtRO4HU",

  "type": "hoticulturecrops"

},
{
 
 
"Portrayal": "https://m.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/01/14/Pictures/_89993720-f94d-11e7-b42e-2d533d154b0f.jpg",

  "Crop": "Cotton",
 
 "SowingSeason": "April-May",
 
 "HarvestingSeason": "December-January",

 "CultivationPractice": "After ploughing the soil cotton seeds are planted in rows by hand or machine. About two months after planting,  flower buds appear on the cotton plants. In another three weeks, the blossoms open. Their petals change from creamy  yellow-white to yellow, then pink and finally, dark red. The flower then dies, leaving green pods that are called cotton  bolls. Inside the football-shaped boll, moist fibers grow and push out from the newly formed seeds. As the boll ripens,  it turns brown. Under the late summer sun the fibers continue to expand until they split the boll apart. The cotton dries  when exposed to the sun. Now it’s ready to be harvested. Youtube Link:https://www.youtube.com/watch?v=TbYNf9vY5YU",
  
"type": "cashcrops"

},
{
  

  "Portrayal": "https://bangladeshpost.net/webroot/uploads/featureimage/2019-05/5cd400aa43bce.jpg",
  
"Crop": "Jute",
  
"SowingSeason": "March-May",

  "HarvestingSeason": "June-September",
 
 "CultivationPractice": "Seeds can be sown either by broadcasting or by line sowing. Jute plants can reach harvesting stage 140 days after  sowing. After this, the jute plants are cut to the ground and tied into bundles. After that, sheaf of jute stocks are  immersed in flood water or ponds or stagnant water for about 2 - 3 weeks for retting. High temperature of water is advised  which quickens the process of retting. Once retting is done, the bark is peeled from the plant & fiber is removed. Then  comes stripping, rinsing, washing and cleaning. After that the fiber is dried in the sun and pressed into bales. Youtube Link:https://www.youtube.com/watch?v=Y2tfUwsaALs",
 
 "type": "cashcrops"

},
{
 
 "Portrayal": "https://st3.depositphotos.com/6677774/35477/v/600/depositphotos_354775792-stock-video-rice-field-green-agriculture-ecosystem.jpg",
 
 "Crop": "Rice",
 
 "SowingSeason": "May to July",
 
 "HarvestingSeason": "September to October",
 
 "CultivationPractice": "The fields are initially ploughed and then fertiliser is applied which typically consists of cow dung and then the field is smoothed. The seeds are transplanted by hand and then through proper irrigation, the seeds are cultivated. Rice grows on a variety of soils like silts, loams and gravels. Youtube Link: https://www.youtube.com/watch?v=BslEAtl9pzI",
 
 "type": "foodcrops"

},
{
   
"Portrayal": "https://africanagribusiness.com/wp-content/uploads/2018/09/maize-farming-kenya.jpg",
  
"Crop": "Maize",
 
 "SowingSeason": "June to September",

  "HarvestingSeason": "January to February",
  
"CultivationPractice": "Maize can be grown throughout the year at altitude ranging from sea level to about 300 m. Maize grows best in areas with rainfall of 600-900 mm. It requires fertile, well-drained soil with a pH ranging from 5.5-8.0, but pH 6.0-7.0 is optimum. Plough the land three times and prepare ridges and furrows. Dibble one seed per hole at a spacing of 60 cm x 23 cm for the rainy season crop. For irrigated crop, beds are prepared. Here, seeds are sown in lines and earthed up later in to small ridges to form furrows when the crop reaches knee height. Youtube Link:https://www.youtube.com/watch?v=NLQ2auANTe0",
  
"type": "foodcrops"

},
{
  
  "Portrayal": "https://miro.medium.com/max/2022/1*brgt6gPYKhf3aGHjWjTnNg.png",
 
 "Crop": "Sugarcane",
  
"SowingSeason": "January to march",

  "HarvestingSeason": "December to March",
  
"CultivationPractice": "The native method of sowing sugarcane is to plough the land some three to five times, the plough going round and round the field and forming a fine seed-bed about 10 to 15 cm deep. Next the field is leveled and the cuttings of seed cane are planted. New canes are usually planted by taking cuttings from old plants. Youtube Link: https://www.youtube.com/watch?v=RDrlxv_V7JE",
  
"type": "cashcrops"

},
{
  
  "Portrayal": "https://lh3.googleusercontent.com/proxy/2LwX4srOGRHgFMk8r85fmoGOs5KS-m4CYRTXFohTKs3ZrUuTmsnVj9yu5jgeXSP9phaWumeCJoiAcMQ-at1mExh-HvTGYHVBz2Aig3Gd6jH_mRo892gtzoZ-LIrh1dCqHWUrtLkxJvh43nZ9Q5WVhh_3usqHUA",
 
 "Crop": "Green Gram Plant",
 
 "SowingSeason": "March to June",

  "HarvestingSeason": "60 to 65 days after planting",
 
 "CultivationPractice": "The main field selected for green gram cultivation must not have been sown with moong or green gram in the previous seasons to avoid volunteer plants that will cause admixture. Prepare the main field by plowing for fine tilth and form channels and beds for green gram cultivation. To supplement the soil with proper nutrients, apply lime at the rate of 2 tonnes/ha along with farm yard manure @ 12.5 tonnes/ha or composted coir pith at 13 tonnes/ha to get an extra yield of about 15 % to 20%.",

  "type": "foodcrops"

}]